spec/fixtures/payments.xml

<IntuitResponse xmlns="http://schema.intuit.com/finance/v3" time="2014-02-28T22:07:21.916-08:00">
  <QueryResponse startPosition="1" maxResults="3">
    <Payment domain="QBO" sparse="false">
      <Id>5</Id>
      <SyncToken>0</SyncToken>
      <MetaData>
        <CreateTime>2014-02-28T00:26:31-08:00</CreateTime>
        <LastUpdatedTime>2014-02-28T00:26:31-08:00</LastUpdatedTime>
      </MetaData>
      <TxnDate>2013-07-11</TxnDate>
      <Line>
        <Amount>40.00</Amount>
        <LinkedTxn>
          <TxnId>2</TxnId>
          <TxnType>Invoice</TxnType>
        </LinkedTxn>
      </Line>
      <CustomerRef>1</CustomerRef>
      <DepositToAccountRef>4</DepositToAccountRef>
      <TotalAmt>40.00</TotalAmt>
      <UnappliedAmt>0</UnappliedAmt>
      <ProcessPayment>false</ProcessPayment>
    </Payment>
    <Payment domain="QBO" sparse="false">
      <Id>4</Id>
      <SyncToken>0</SyncToken>
      <MetaData>
        <CreateTime>2014-02-26T22:54:29-08:00</CreateTime>
        <LastUpdatedTime>2014-02-26T22:54:29-08:00</LastUpdatedTime>
      </MetaData>
      <TxnDate>2014-02-27</TxnDate>
      <CurrencyRef name="United States Dollar">USD</CurrencyRef>
      <Line>
        <Amount>40.00</Amount>
        <LinkedTxn>
          <TxnId>2</TxnId>
          <TxnType>Invoice</TxnType>
        </LinkedTxn>
      </Line>
      <CustomerRef>1</CustomerRef>
      <DepositToAccountRef>4</DepositToAccountRef>
      <PaymentMethodRef>2</PaymentMethodRef>
      <PaymentRefNum>def</PaymentRefNum>
      <TotalAmt>40.00</TotalAmt>
      <UnappliedAmt>0</UnappliedAmt>
      <ProcessPayment>false</ProcessPayment>
    </Payment>
    <Payment domain="QBO" sparse="false">
      <Id>3</Id>
      <SyncToken>0</SyncToken>
      <MetaData>
        <CreateTime>2014-02-26T22:53:41-08:00</CreateTime>
        <LastUpdatedTime>2014-02-26T22:53:41-08:00</LastUpdatedTime>
      </MetaData>
      <TxnDate>2014-02-27</TxnDate>
      <CurrencyRef name="United States Dollar">USD</CurrencyRef>
      <Line>
        <Amount>20.00</Amount>
        <LinkedTxn>
          <TxnId>2</TxnId>
          <TxnType>Invoice</TxnType>
        </LinkedTxn>
      </Line>
      <CustomerRef>1</CustomerRef>
      <DepositToAccountRef>4</DepositToAccountRef>
      <PaymentMethodRef>1</PaymentMethodRef>
      <PaymentRefNum>abc</PaymentRefNum>
      <TotalAmt>20.00</TotalAmt>
      <UnappliedAmt>0</UnappliedAmt>
      <ProcessPayment>false</ProcessPayment>
    </Payment>
  </QueryResponse>
</IntuitResponse>